[
  {
    "id": 0,
    "title": "Movie Search App Using Next.js 13 / TailwindCSS / TypeScript",
    "slug": "movie-search-app-using-next-js",
    "thumbnail": "0.jpg",
    "link": "https://www.youtube.com/embed/c7cKBSfZf0s?si=ZyHc5l53-koAslO1",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/movie-search-yt",
    "tags": ["Next", "Tailwind", "TypeScript"],
    "lang": "eng",
    "duration": "01:02:02",
    "date": "06/04/2023",
    "desc": "Welcome to our tutorial on creating a Movie Search App using Next.js and Tailwind CSS! If you're ready to build a sleek and efficient web application that allows users to search for and explore movies with ease, you're in for a treat.<br /><br />In this video, we'll take you through the entire process of developing a responsive and visually appealing Movie Search App. We'll harness the power of Next.js for dynamic rendering and Tailwind CSS for elegant styling.<br /><br />You'll learn how to integrate a movie database API, create a user-friendly search interface, and display movie details seamlessly. This project is perfect for web developers looking to enhance their skills in building modern, data-driven applications.<br /><br />By the end of this tutorial, you'll have a fully functional Movie Search App that you can customize and expand to your liking. Join us on this coding adventure – watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's bring your movie exploration app to life!"
  },
  {
    "id": 1,
    "title": "Creating a Multi-Step Form in Next.js 13, React Hook Form and TypeScript",
    "slug": "multi-step-form-using-react-hook-form",
    "thumbnail": "1.jpg",
    "link": "https://www.youtube.com/embed/X-idRZaTE48?si=JJUKPD1pDF0FUGZV",
    "live": null,
    "download": "https://github.com/MdUsmanAnsari/multi-step-form",
    "tags": ["Next", "React-Hook-Form", "TypeScript"],
    "lang": "eng",
    "duration": "39:27",
    "date": "06/25/2023",
    "desc": "Welcome to our tutorial on creating a Multi-Step Form in Next.js 13, using React Hook Form and TypeScript! If you're ready to streamline complex data collection processes on your website, you're in the right place.<br /><br />In this video, we'll guide you through building a responsive and user-friendly Multi-Step Form, perfect for applications that require structured data input. We'll leverage the power of Next.js 13 for seamless navigation and React Hook Form for efficient form handling, all while ensuring type safety with TypeScript.<br /><br />You'll learn how to divide your form into manageable steps, validate user inputs, and provide a smooth user experience. This project is ideal for web developers aiming to enhance their skills in creating interactive and data-driven applications.<br /><br />By the end of this tutorial, you'll have a fully functional Multi-Step Form that you can adapt for your specific data collection needs. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's simplify complex data gathering together!"
  },
  {
    "id": 2,
    "title": "Collapsible Sidebar in Next.js",
    "slug": "collapsible-sidebar-in-next-js",
    "thumbnail": "2.jpg",
    "link": "https://www.youtube.com/embed/_ORPWeJFXwQ?si=I0RAUT1Us8csgVIB",
    "live": null,
    "download": "https://github.com/MdUsmanAnsari/collapsible-sidebar-in-nextjs",
    "tags": ["Next", "TypeScript"],
    "lang": "eng",
    "duration": "41:16",
    "date": "01/29/2023",
    "desc": "Welcome to our tutorial on creating a Collapsible Sidebar in Next.js! If you're looking to elevate your web development skills and provide an interactive and space-saving navigation solution for your website, you're in the right place.<br /><br />In this video, we'll guide you through the process of implementing a collapsible sidebar that enhances user experience and optimizes screen real estate. We'll leverage the power of Next.js for seamless integration and React for dynamic rendering.<br /><br />You'll learn how to design and code a user-friendly sidebar that expands and collapses smoothly, providing users with quick access to important sections of your website. This project is perfect for web developers aiming to create modern and responsive user interfaces.<br /><br />By the end of this tutorial, you'll have a fully functional Collapsible Sidebar that you can customize and integrate into your own projects. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's enhance user navigation together!"
  },
  {
    "id": 3,
    "title": "Create a Responsive Shopping Website with Next.js and Tailwind | Tutorial",
    "slug": "responsive-shopping-website-with-next-js-and-tailwind",
    "thumbnail": "3.webp",
    "link": "https://www.youtube.com/embed/KzqNLDMSdMc?si=16dUKfMv6EZvOaRI",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/shopping-web-app",
    "tags": ["Next", "Tailwind", "TypeScript"],
    "lang": "eng",
    "duration": "01:10:46",
    "date": "07/27/2023",
    "desc": "Welcome to our comprehensive tutorial on building a responsive shopping website using Next.js and Tailwind CSS! If you're ready to take your web development skills to the next level and create an elegant and fully responsive e-commerce site, you're in the right place.<br /><br />In this video, we'll guide you through every step of the process, from setting up the Next.js project to styling your site with the power of Tailwind CSS. You'll learn how to create product listings, handle shopping cart functionality, and provide a seamless user experience for online shoppers.<br /><br />We'll also explore responsive design techniques to ensure your e-commerce website looks fantastic on all devices, from desktops to mobile phones. By the end of this tutorial, you'll have a polished and fully functional shopping website that you can proudly showcase or customize for your own e-commerce venture.<br /><br />Join us on this exciting coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's bring your e-commerce vision to life and elevate your online business!"
  },
  {
    "id": 4,
    "title": "Creating a Modern Portfolio with Next.js and Tailwind CSS | Web Development Tutorial",
    "slug": "creating-a-modern-portfolio-with-next-and-tailwind",
    "thumbnail": "4.webp",
    "link": "https://www.youtube.com/embed/OvC3iM1hA90?si=gm-tQOAfJAP-38JR",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/portfolio-yt--1",
    "tags": ["Next", "Tailwind", "TypeScript"],
    "lang": "eng",
    "duration": "01:04:34",
    "date": "08/02/2023",
    "desc": "Welcome to my Next.js and Tailwind CSS portfolio showcase! In this video, I'm thrilled to present a compilation of my latest web development projects, all crafted with the power of Next.js and the beauty of Tailwind CSS. Watch as I walk you through each project, demonstrating the seamless integration of these cutting-edge technologies. From stunning user interfaces to impressive functionality, I've poured my heart and soul into these web creations. Whether you're a fellow developer seeking inspiration or a curious viewer interested in modern web design, join me on this journey to witness the potential of Next.js and Tailwind CSS in action! Don't forget to like, subscribe, and hit the notification bell to stay tuned for more exciting content. Let's elevate the art of web development together!"
  },
  {
    "id": 5,
    "title": "Create a Responsive Food Website with Next.js and Tailwind | Tutorial",
    "slug": "responsive-food-website-with-next-and-tailwind",
    "thumbnail": "5.webp",
    "link": "https://www.youtube.com/embed/v0m-sCGilio?si=LGaXYAqgi0sNd47O",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/food-app-yt",
    "tags": ["Next", "Tailwind", "TypeScript"],
    "lang": "eng",
    "duration": "58:53",
    "date": "08/06/2023",
    "desc": "Discover an enticing food website created using Next.js and Tailwind CSS! Delight in a diverse collection of delectable recipes, insightful cooking tips, and captivating food blogs. Engage with a passionate community of food enthusiasts and savor our fully responsive design, ensuring a seamless experience on any device. Join us on YouTube for an exclusive behind-the-scenes look at the development process and innovative features. Celebrate the joy of food together with us! 🍔🥗🍕🍰🎥🌐"
  },
  {
    "id": 6,
    "title": "Full Stack CRUD Operations | React, Node, Express & MongoDB",
    "slug": "fullstack-crud-operations",
    "thumbnail": "6.webp",
    "link": "https://www.youtube.com/embed/xElA9mGi-I0?si=w5E7Sf5508rujsK8",
    "live": null,
    "download": "https://www.buymeacoffee.com/thebravecoders/e/163809",
    "tags": ["React", "Node", "Express", "MongoDB"],
    "lang": "eng",
    "duration": "01:00:43",
    "date": "03/14/2023",
    "desc": "Welcome to our comprehensive tutorial on Full Stack CRUD Operations! In this video, we'll guide you through the process of creating a full-stack web application capable of performing Create, Read, Update, and Delete (CRUD) operations on data.<br /><br />Whether you're a beginner or an experienced developer, understanding CRUD operations is fundamental for building dynamic web applications. In this tutorial, we'll cover everything you need to know, from setting up a backend server using Node.js and Express to creating a sleek and responsive frontend.<br /><br />You'll learn how to create, retrieve, update, and delete data seamlessly while gaining insights into RESTful API design and database interactions. By the end of this tutorial, you'll have a solid grasp of CRUD operations and the skills to implement them in your own projects.<br /><br />Join us on this coding journey – watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's dive into the world of Full Stack CRUD Operations together!"
  },
  {
    "id": 7,
    "title": "Building a Todo App from Scratch with JavaScript and Local Storage",
    "slug": "todo-app-with-javascript-and-local-storage",
    "thumbnail": "7.jpg",
    "link": "https://www.youtube.com/embed/rKG2Id4XK_U?si=E_ZbOuIHiXtxvKWH",
    "live": null,
    "download": null,
    "tags": ["JavaScript", "Local Storage"],
    "lang": "eng",
    "duration": "38:54",
    "date": "08/29/2023",
    "desc": "In this comprehensive YouTube tutorial, we're diving into the world of web development as we build a fully functional Todo App from scratch using JavaScript and the powerful Local Storage feature. 🚀<br /><br />📌 What You'll Learn:<br /><br />1. Setting up the basic structure of a web page with HTML and CSS.<br />2. Implementing interactive features with JavaScript to add, and remove todo.<br />3. Leveraging Local Storage to save todo even after closing the browser."
  },
  {
    "id": 8,
    "title": "Full Stack Login System with JWT Authentication using Node, Next, Tailwind & MongoDB",
    "slug": "full-stack-login-system-with-next-node-tailwind-and-mongodb",
    "thumbnail": "8.webp",
    "link": "https://www.youtube.com/embed/usXQs3KIwZM?si=Ybf5SROG9OVrxwcV",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/full-stack-login-flow",
    "tags": ["Node", "Next", "Tailwind", "JWT", "MongoDB"],
    "lang": "eng",
    "duration": "01:19:17",
    "date": "09/04/2023",
    "desc": "Welcome to our comprehensive tutorial on creating a full-stack login flow with JWT authentication using Node.js, Next.js, Tailwind CSS, and MongoDB. If you're ready to dive deep into web development and implement a secure user authentication system, you're in the right place.<br /><br />In this video, we'll guide you through the entire process of building a robust authentication system, from setting up the backend with Node.js and MongoDB to creating a polished frontend interface with Next.js and Tailwind CSS. You'll learn how to handle user registration, login, JWT token generation, and secure route protection.<br /><br />Our tutorial is packed with clear explanations, practical examples, and best practices to ensure you not only understand each component but also implement them effectively. By the end of this video, you'll have a fully functional, secure login system that you can seamlessly integrate into your own projects.<br /><br />Join us on this coding journey - watch the video now, like, share, and subscribe for more web development tutorials. Elevate your web applications with confidence by mastering JWT authentication with Node, Next.js, Tailwind CSS, and MongoDB!"
  },
  {
    "id": 9,
    "title": "Creating a Responsive eCommerce Website with React and Tailwind CSS with Add To Cart Functionality",
    "slug": "responsive-ecommerce-website-with-react-and-tailwind",
    "thumbnail": "9.webp",
    "link": "https://www.youtube.com/embed/vpLgOnn-qC8?si=NXDmYYq3O9yFqx7S",
    "live": "https://thebravecoders-ecommerce-website-react-tailwind.vercel.app",
    "download": "https://www.buymeacoffee.com/thebravecoders/e/163501",
    "tags": ["React", "Tailwind"],
    "lang": "eng",
    "duration": "01:01:32",
    "date": "08/31/2023",
    "desc": "Welcome to our in-depth tutorial on building a responsive eCommerce website using React and Tailwind CSS. If you're eager to dive into the world of web development and create your own online store, you're in the right place.<br /><br />In this video, we'll take you through every step of crafting a dynamic, visually appealing, and fully responsive eCommerce site. We'll harness the power of React for building interactive components and leverage Tailwind CSS for efficient and beautiful styling.<br /><br />Our comprehensive guide covers project setup, product listing creation, shopping cart integration, and a seamless checkout process. We'll also delve into responsive design techniques to ensure your site looks impeccable on all devices, from desktops to smartphones.<br /><br />By the end of this tutorial, you'll have a fully functional eCommerce website that you can further customize and launch for your business or personal project. Join us on this exciting coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's bring your eCommerce vision to life!"
  },
  {
    "id": 10,
    "title": "Full Stack ToDo App | Node, React, Express, MongoDB Tutorial",
    "slug": "full-stack-todo-app",
    "thumbnail": "10.jpg",
    "link": "https://www.youtube.com/embed/PvMDWbAPPK4?si=-Z6a4VazN1c2xTaY",
    "live": null,
    "download": "https://www.buymeacoffee.com/thebravecoders/e/163822",
    "tags": ["React", "Node", "Express", "MongoDB"],
    "lang": "eng",
    "duration": "01:09:36",
    "date": "10/03/2022",
    "desc": "Welcome to our coding tutorial! In this video, we're excited to walk you through the creation of a Full Stack ToDo App. Whether you're a beginner eager to learn the ropes of web development or a seasoned programmer looking to refine your skills, this tutorial is designed to cater to all levels.<br /><br />You'll embark on a journey to build a robust and fully functional task manager application. We'll cover everything from setting up the backend server with Node.js, Express, and MongoDB to creating a sleek and intuitive frontend using HTML, CSS, and JavaScript.<br /><br />Our step-by-step guidance and practical examples will ensure you grasp each concept clearly, from handling task creation and deletion to user authentication and data persistence. By the end of this tutorial, you'll have a powerful ToDo App that you can customize and expand according to your needs.<br /><br />Join us on this coding adventure - watch the video now, like, share, and subscribe for more programming insights and tutorials. Let's create your ultimate task manager together!"
  },
  {
    "id": 11,
    "title": "Read More / Read Less Button with JavaScript | No Plugin HTML CSS JavaScript Tutorial",
    "slug": "read-more-read-less-with-javascript",
    "thumbnail": "11.webp",
    "link": "https://www.youtube.com/embed/4Pf6l0axYGg?si=IWVo6Ca_TSSYRUBT",
    "live": null,
    "download": "https://github.com/MdUsmanAnsari/youtube-tutorials/tree/main/read-more__read-less",
    "tags": ["HTML", "CSS", "JavaScript"],
    "lang": "eng",
    "duration": "05:39",
    "date": "12/10/2020",
    "desc": "Welcome to our JavaScript tutorial! In this video, we'll show you how to create a 'Read More / Read Less' button for your web content using pure JavaScript. If you're looking to improve user experience on your website by providing an efficient way to expand and collapse lengthy text or information, you're in the right place.<br /><br />You'll learn step-by-step how to implement this interactive feature, allowing users to see a concise preview of your content and then reveal the full text with a simple click. This technique is particularly useful for blogs, articles, product descriptions, or any web content that benefits from condensed previews.<br /><br />Whether you're a beginner or an experienced web developer, this tutorial will equip you with the skills to enhance your web content interactivity using JavaScript. By the end of this video, you'll have a valuable addition to your web development toolkit.<br /><br />Join us on this coding journey - watch the video now, like, share, and subscribe for more web development tips and tutorials. Let's make your web content more engaging with the 'Read More / Read Less' button!"
  },
  {
    "id": 12,
    "title": "Form Validation in React with React Hook Form",
    "slug": "form-validation-with-react-hook-form.",
    "thumbnail": "12.webp",
    "link": "https://www.youtube.com/embed/K4r6nw6aeg4?si=rDyRKeaucKxrFa-T",
    "live": null,
    "download": null,
    "tags": ["React", "React-Hook-Form"],
    "lang": "eng",
    "duration": "32:08",
    "date": "10/05/2022",
    "desc": "Welcome to our tutorial on Form Validation in React using React Hook Form! If you're eager to ensure data accuracy and reliability in your web applications, you're in the right place.<br /><br />In this video, we'll guide you through the process of implementing robust form validation using React Hook Form, a powerful library for managing forms in React. You'll learn how to validate user inputs, handle errors gracefully, and provide users with clear feedback.<br /><br />We'll cover essential concepts such as input validation rules, error messages, and conditional validation. Whether you're a beginner or an experienced React developer, this tutorial will equip you with the skills needed to create forms that collect accurate data and improve user experience.<br /><br />By the end of this tutorial, you'll have a solid understanding of form validation in React, empowering you to build dependable and user-friendly web applications. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's create reliable user inputs together!"
  },
  {
    "id": 13,
    "title": "Sidebar in React js | React.js Tutorial",
    "slug": "sidebar-in-react-js",
    "thumbnail": "13.webp",
    "link": "https://www.youtube.com/embed/DXgxnh9Y-N0?si=X95jdmh5owILtMFy",
    "live": null,
    "download": null,
    "tags": ["React"],
    "lang": "eng",
    "duration": "14:28",
    "date": "11/24/2021",
    "desc": "Welcome to our React.js tutorial! In this video, we'll guide you through creating a sidebar for your web application. If you're looking to enhance user experience by adding a user-friendly navigation system, you're in the right place.<br /><br />Learn how to design and code a versatile sidebar that can expand and collapse, making navigation intuitive for your users. Whether you're building a personal project or a complex web application, a well-designed sidebar can greatly improve accessibility.<br /><br />We'll explore various React.js components and techniques, allowing you to customize your sidebar's appearance and functionality to suit your specific needs. This tutorial is suitable for both beginners and experienced developers.<br /><br />By the end of this video, you'll have the skills to integrate a responsive sidebar into your React.js application, making it more user-friendly and visually appealing. Join us on this coding journey - watch the video now, like, share, and subscribe for more React.js tutorials and web development insights. Let's streamline your web app's navigation with a sidebar!"
  },
  {
    "id": 14,
    "title": "Animated Accordion using Next js / React js & Tailwind CSS | Accordion with plus minus icon",
    "slug": "animated-accordion-using-next-js",
    "thumbnail": "14.webp",
    "link": "https://www.youtube.com/embed/k_rVnQb4R6s?si=MtucyXlzdAKFE4Hr",
    "live": null,
    "download": null,
    "tags": ["Next", "Tailwind"],
    "lang": "eng",
    "duration": "18:48",
    "date": "11/19/2022",
    "desc": "Welcome to our tutorial on creating an Animated Accordion using Next.js, React.js, and Tailwind CSS! In this video, we'll guide you through the process of building an engaging and interactive web component that's perfect for displaying organized content.<br /><br />Accordion menus are a fantastic way to make your web pages more compact and user-friendly, and adding animations to them can bring them to life. Whether you're a beginner or an experienced developer, this tutorial will provide valuable insights into creating dynamic user interfaces.<br /><br />Learn how to design and code an Accordion that smoothly expands and collapses sections with appealing animations. We'll explore the power of Next.js and React.js for component creation, as well as leverage the styling capabilities of Tailwind CSS.<br /><br />By the end of this tutorial, you'll have a stylish and interactive Animated Accordion that you can easily integrate into your own web projects. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development tips and tutorials. Let's elevate your web interactivity with an Animated Accordion!"
  },
  {
    "id": 15,
    "title": "How to use Next js API + MongoDB together | MongoDB / Mongoose in Next js",
    "slug": "use-next-and-mongodb-together",
    "thumbnail": "15.jpg",
    "link": "https://www.youtube.com/embed/kjEB-B1S6nI?si=3ZrOditH6IzMbqef",
    "live": null,
    "download": null,
    "tags": ["Next", "MongoDB"],
    "lang": "eng",
    "duration": "37:52",
    "date": "02/28/2023",
    "desc": "Welcome to our comprehensive tutorial on using Next.js API with MongoDB! In this video, we'll guide you through the process of combining Next.js, a powerful React framework, with MongoDB, a versatile NoSQL database, to create robust and data-driven web applications.<br /><br />Whether you're a web developer looking to expand your skill set or a beginner eager to learn, this tutorial is tailored for you. We'll cover everything from setting up your Next.js project to integrating MongoDB for seamless data storage and retrieval.<br /><br />You'll learn how to create RESTful APIs with Next.js, handle database operations, and serve data to your frontend. This dynamic combination allows you to build feature-rich web applications with ease.<br /><br />By the end of this tutorial, you'll have a solid foundation in using Next.js API with MongoDB, enabling you to tackle a wide range of web development projects. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development insights and tutorials. Let's build powerful web apps together!"
  },
  {
    "id": 16,
    "title": "Photo Gallery MERN App | How To Handle File Upload In MERN App",
    "slug": "photo-gallery-mern-app",
    "thumbnail": "16.jpg",
    "link": "https://www.youtube.com/embed/zMR_NI7zISE?si=uz86L3wUFSFha-ID",
    "live": null,
    "download": "https://github.com/AbdulMoqueet/photo-gallery-app-yt",
    "tags": ["Node", "React", "Express", "MongoDB"],
    "lang": "eng",
    "duration": "01:01:13",
    "date": "02/12/2023",
    "desc": "Welcome to our tutorial on building a Photo Gallery MERN App! In this video, we'll guide you through the process of creating a feature-rich web application that enables users to showcase their photos in a beautiful and organized gallery.<br /><br />Using the MERN stack (MongoDB, Express, React, and Node.js), you'll learn how to develop a full-fledged web app that includes user authentication, image uploading, storage, and dynamic rendering. Whether you're a beginner or an experienced developer, this tutorial offers valuable insights into modern web application development.<br /><br />We'll cover everything from setting up the backend API with Node.js and Express to building a responsive frontend with React. You'll also explore MongoDB for efficient data storage and retrieval.<br /><br />By the end of this tutorial, you'll have a powerful Photo Gallery MERN App that you can customize and expand for various creative and business purposes. Join us on this coding journey - watch the video now, like, share, and subscribe for more web development tips and tutorials. Let's bring your photo gallery vision to life!"
  },
  {
    "id": 17,
    "title": "Creating a Responsive eCommerce Website with React and Tailwind CSS | Hindi Tutorial",
    "slug": "responsive-ecommerce-website-react-tailwind",
    "thumbnail": "17.jpg",
    "link": "https://www.youtube.com/embed/Dtx9fybdiBE?si=fQJW_rf521bEaPvD",
    "live": "https://thebravecoders-ecommerce-website-react-tailwind.vercel.app",
    "download": "https://www.buymeacoffee.com/thebravecoders/e/163501",
    "tags": ["React", "Tailwind"],
    "lang": "hindi",
    "duration": "01:13:35",
    "date": "08/27/2023",
    "desc": "Welcome to our comprehensive tutorial on creating a Responsive eCommerce Website using React and Tailwind CSS. If you're ready to embark on a journey to design and develop a fully functional online store, you've come to the right place.<br /><br />In this video, we'll guide you through the entire process of building an eCommerce website that is not only visually stunning but also fully responsive to various devices and screen sizes. We'll use the power of React for dynamic components and Tailwind CSS for efficient styling.<br /><br />You'll learn how to set up your project, create product listings, implement shopping cart functionality, and handle the checkout process. Additionally, we'll explore responsive design techniques to ensure your eCommerce site looks great on desktops, tablets, and smartphones.<br /><br />By the end of this tutorial, you'll have a fully functional eCommerce website that you can customize and expand to launch your own online store. Join us on this exciting coding journey - watch the video now, like, share, and subscribe for more web development tutorials. Let's bring your eCommerce dream to life!"
  },
  {
    "id": 18,
    "title": "Responsive Movieverse Website using Next, Tailwind & TMDB API",
    "slug": "movieverse-website-using-next-and-tailwind",
    "thumbnail": "18.webp",
    "link": "https://www.youtube.com/embed/1EsszBdWDDw?si=1XVI2YYePiJN6IHS",
    "live": "https://movieverse-thebravecoders.vercel.app",
    "download": "https://www.buymeacoffee.com/thebravecoders/e/171043",
    "tags": ["Next", "Tailwind", "TMDB API"],
    "lang": "hindi",
    "duration": "02:07:09",
    "date": "09/28/2023",
    "desc": "Welcome to our tutorial on building a Responsive Movieverse Website! In this video, we'll take you on a thrilling coding adventure, where you'll learn how to create a dynamic and visually appealing movie website using Next.js, Tailwind CSS, and the powerful TMDB API.<br /><br />Unlock the secrets of building a feature-rich website that provides users with an immersive cinematic experience. We'll guide you through every step, from setting up the Next.js project to fetching movie data from the TMDB API and styling your site with Tailwind CSS.<br /><br />Whether you're a web development enthusiast or a seasoned developer, this tutorial offers valuable insights into creating responsive and engaging web applications. By the end of this tutorial, you'll have a fully functional Movieverse Website that allows users to explore the cinematic universe with ease.<br /><br />Join us on this coding journey - watch the video now, like, share, and subscribe for more web development tips and tutorials. Let's dive into the world of movies together!"
  }
]
